import React from 'react';
import HeadMeta from '../components/headMeta';
import Footer from 'Components/common/Footer';
import styled from 'styled-components';

const privacy = ({ classes }) => {
  return (
    <div>
      <HeadMeta />
      <RootStyle>
        <DivStyle>
          <br />
          <TittleStyle>隱私權條款</TittleStyle>
          <br />
          <TextStyle>
            我們瞭解在線上訂票需要您對我們有極大的信任。我們非常重視這份信任。本「隱私權聲明」說明我們將如何使用您透過富爾特科技股份有限公司所擁有及營運的
            影城通網站 (636.com.tw) 網站提供的資料。
          </TextStyle>
          <br />
          <TextStyle>
            請注意，本「隱私權聲明」是我們網站與所提供服務中不可缺少的一部分，不得以任何方式從使用條款和條件中分離開，也不得從會員資格、使用或交易處理程序中分離開。為幫助您瞭解本網站如何蒐集、處理及利用您所提供的個人資料以及您就個人資料所享有的權利，請詳細閱讀本隱私權聲明。一旦透過您在本網站提供資訊，即表示您接受本「隱私權聲明」中所說明的規則。如您不同意本隱私權聲明者，請立即停止使用本網站服務，已申請會員帳號者並請立即刪除帳號，感謝您的配合。
          </TextStyle>
          <br />
          <br />
          <SubStyle>資訊收集與使用</SubStyle>
          <br />
          <P> • 問卷活動與抽獎活動</P>
          <TextStyle>
            我們會不定期藉由問卷活動或抽獎活動來要求提供使用者的資訊。參與這些問卷活動或抽獎活動純屬自願性質，因此您可以選擇是否提供這些資訊。要求的資訊通常包括聯絡資訊
            (例如姓名與郵寄地址) 以及統計資訊
            (例如郵遞區號)。聯絡資訊將用於通知獲獎者及贈與獎項。問卷資訊則將用於監控或改善我們網站之使用情形與滿意度。雖然我們可能透過服務供應商來舉辦這些問卷活動或抽獎活動
            (如「資訊分享」一節中所述)，因此服務供應商需知悉您在所提供之個人識別資訊，服務供應商不得將您的個人識別資訊移做任何其他用途。
          </TextStyle>
          <br />
          <P> • Cookie</P>
          <TextStyle>
            Cookie 是儲存在您電腦上您的一小段相關資訊。我們使用兩種 Cookie，一種是工作階段 ID (或暫時性)
            Cookie，當您關閉瀏覽器時即會終止，另一種則是儲存在您硬碟上的永久性 Cookie。我們之所以使用 Cookie
            有幾個原因。例如，Cookie 讓您不用在每次登入時都要鍵入登入名稱，只需提供密碼即可進入系統。Cookie
            也讓我們能夠追蹤與鎖定使用者的興趣，以期改善我們網站的使用體驗。大多數的 Web 瀏覽器都會自動接受
            Cookie，但您也可以依照個人意願編輯您的瀏覽器選項，從而在以後阻斷它們。如果您選擇拒絕
            Cookie，您仍然可以造訪我們網站；然而在進入我們網站上某些區域時會受到限制。我們的第三方廣告公司也可能會將
            Cookie
            檔案置入您的硬碟中。這些公司可能要進行彙總的統計，計算您造訪本網站與其他網站的次數，以針對您可能感興趣的電影方面商品與服務提供廣告。影城通網站
            (636.com.tw) 無法使用或控制這些可能由第三方廣告商所置入的 Cookie。使用永久性 Cookie
            的廣告網路可能會提供您停止成為廣告目標的方法。第三方廣告公司也可能運用技術來評估廣告的有效性。為此，它們會在我們網站上放置網站信標
            (單點圖)
            以收集匿名資訊。它們可能使用您造訪本網站與其他網站的匿名資訊，藉此針對您可能感興趣的商品與服務提供廣告。透過這種處理方式所收集的資訊是匿名的，不會在線上動作與可識別的個人間產生關聯。
          </TextStyle>
          <br />
          <br />
          <SubStyle>標記</SubStyle>
          <br />
          <TextStyle>
            為配合我們與關係企業的行銷活動，我們也可能運用技術，針對您透過我們網站所進行的預訂來擷取特定資訊。我們通常會在我們的預訂頁面放置網站信標
            (單點圖)，藉以收集這些資訊。我們所收集的資訊是匿名的，其中包括交易的總金額與系統產生的預訂代號。我們將使用這些資訊來觀察我們行銷活動的有效性，並可能將這些資訊傳送給我們的關係企業，以用於類似的用途。我們可能藉由第三方服務供應商對收集到的資訊進行整理並做出報告。
          </TextStyle>
          <br />
          <br />
          <SubStyle>記錄檔案</SubStyle>
          <br />
          <TextStyle>
            如同大多數的標準網站伺服器，我們使用記錄檔案收集網際網路通訊協定 (IP) 位址、瀏覽器類型、網際網路服務供應商
            (ISP)、參考的頁面/結束頁面、平台類型、日期/時間戳記、點選次數以及點選的頁面位置。我們使用這些資訊來分析趨勢、管理網站、全面追蹤使用者的活動情況、診斷伺服器問題，以及廣泛收集統計資訊來進行彙總。這些資訊不會與個人識別資訊產生關聯。
          </TextStyle>
          <br />
          <br />
          <SubStyle>來自網站的訊息</SubStyle>
          <br />
          <P> • 特別優惠與最新資訊</P>
          <TextStyle>
            如上所述，影城通會員不定期會收到感興趣的產品、服務與促銷活動的相關資訊。基於對使用者隱私權的尊重，我們提供會員不接收此類型訊息的選項。請參閱下述之「選擇/拒絕」一節。
          </TextStyle>
          <br />
          <P> • 電影資訊與客戶回饋</P>
          <TextStyle>
            如果您透過我們網站進行預訂，除通知您預訂狀態外
            (請參閱上述「預約訂購」)，我們還會在您看電影前傳送電子郵件給您，內含電影取票提醒…等；我們不定期會加入與您即將到來的電影有關、且您可能會感興趣的其他產品與服務資訊。您將可以選擇未來預訂時是否拒收這類的電子郵件。
          </TextStyle>
          <br />
          <P> •服務公告</P>
          <TextStyle>
            在罕見的情況下，我們必須送出服務方面的公告。例如，如果我們的服務因為維護而暫時中止，我們可能會傳送電子郵件給您。您不能拒絕這種非促銷類的訊息，儘管您可以撤銷會員資格。
          </TextStyle>
          <br />
          <P> • 客戶服務</P>
          <TextStyle>
            我們會定期與您通訊，以提供要求的服務。這可能包括透過電子郵件或電話回覆，按您的希望而定。
          </TextStyle>
          <br />
          <P> • 選擇/拒絕</P>
          <TextStyle>您可以選擇不讓 影城通網站 (636.com.tw) 繼續使用您的資訊來傳送促銷訊息。</TextStyle>
          <br />
          <br />

          <SubStyle>資訊分享</SubStyle>
          <br />
          <P>• 免責聲明</P>
          <TextStyle>
            雖然我們盡力保護使用者隱私權，我們仍有權依據我方營運流程、交易安全、商業政策、網站維護更新等需求，或依據相關法令負有法定義務或考量公共利益之情形，而利用或公開您所提供的資訊，包括但不限於針對威脅我們利益
            (如客戶詐欺)
            的人士，或其活動可能損害或傷害其他人的人士，此外我們可能必須向第三方提供客戶資訊，例如信用卡公司，以解決一般業務中所發生的糾紛。
          </TextStyle>
          <br />
          <P>• 彙總資訊(非個人識別性)</P>
          <TextStyle>
            我們會與商業合作夥伴和廣告商分享彙總的統計資訊。這些資訊不會與任何個人識別資訊產生關聯。
          </TextStyle>
          <br />
          <P>• 獲得授權的服務供應商</P>
          <TextStyle>
            我們會與獲得授權代表我方執行特定功能或服務的服務供應商分享您的個人識別資訊。例如，我們會透過外部的信用卡處理公司與銀行金流處理公司，向使用者收取商品與服務的費用。我們也依靠服務供應商來完成訂購、遞送包裹、執行業務與銷售分析以及提供行銷協助。這些公司無權分享、儲存或使用我們提供的個人識別資訊，以用於任何其他用途。我們也可能與聲譽良好的第三方締約，協助公佈調查、促銷活動或抽獎活動資訊。當這些專案結束時，所有資訊都會返回給我們。最後，我們有時會與服務供應商分享彙總的資訊。這些資訊不含任何個人識別資訊，而是用來開發我們的會員與網站訪問者會感興趣的特色活動與內容。
          </TextStyle>
          <br />
          <P>• 供應商</P>
          <TextStyle>
            如果您是從其他網站透過友情連結連線至我們網站，我們可能會與此友情連結網站分享您的個人識別資訊，以更好地瞭解我們網站的使用狀況。雖然我們相信讓您透過友情連結連線至我們網站的那些網站公司聲譽良好，但我們並未限制這些友情連結網站公司在未經您同意的情況下使用或公開您的資訊。因此，如果您是從任何網站參考到我們網站，請務必檢閱其資訊隱私權規則。
          </TextStyle>
          <br />
          <P>• 關係企業/參考的網站</P>
          <TextStyle>
            如果您是從其他網站透過友情連結連線至我們網站，我們可能會與此友情連結網站分享您的個人識別資訊，以更好地瞭解我們網站的使用狀況。雖然我們相信讓您透過友情連結連線至我們網站的那些網站公司聲譽良好，但我們並未限制這些友情連結網站公司在未經您同意的情況下使用或公開您的資訊。因此，如果您是從任何網站參考到我們網站，請務必檢閱其資訊隱私權規則。
          </TextStyle>
          <br />
          <P>• 關係企業</P>
          <TextStyle>
            我們可能會與我們全球各地的關係企業分享您的某些個人識別資訊，這些公司致力於為您提供全面的服務，以滿足您的娛樂需求。分享這些資訊讓我們可以更加瞭解我們的各種產品與服務方案能在哪些方面協助您。就我們的關係企業獲取您這些資訊而言，其保護資訊的程度一定不會低於這些公司保護公司本身其他使用者之資訊的程度。
          </TextStyle>
          <br />
          <P>• 業務轉讓</P>
          <TextStyle>
            雖然我們不斷努力改善為客戶提供的服務，但我們也可能會賣出子公司或營業單位。我們也可能會被其他公司收購或與之合併。在此類情況下，客戶資訊可能成為轉讓的商業資產之一。
          </TextStyle>
          <br />
          <P>• 國際轉讓</P>
          <TextStyle>
            我們會處理中華民國境內的會員與使用者的個人識別資訊。 此外，我們可能與之分享您的資訊的第三方 (如上所述)
            也可能屬於歐盟之外的國家/地區 (如美國)。使用我們網站即表示您瞭解並同意您的資訊將保存及使用於中華民國境內與
            (我們的合作夥伴、服務供應商、關係企業可能所在的) 其他國家。
          </TextStyle>
          <br />
          <P>• 連結</P>
          <TextStyle>
            請注意，我們網站中包含通往其他網站的連結。這些網站可能會收集您的個人識別資訊。本「隱私權聲明」不涵蓋這些網站的資訊收集規則或規定。
          </TextStyle>
          <br />
          <P>• 資訊安全</P>
          <TextStyle>
            我們採取某些步驟以協助保護您提供給我們的個人識別資訊。例如，我們使用領先的加密技術來加密信用卡號碼。我們也規定個人識別資訊的使用只限於需要這些資訊來執行特定工作的員工
            (例如我們的帳務員或客戶服務代表)。存放儲存個人識別資訊之伺服器的設施都會上鎖。如果您對資訊安全有任何疑問，請至客服中心留言。
          </TextStyle>
          <br />
          <P>• 隱私權聲明變更</P>
          <TextStyle>
            我們有權隨時變更隱私權規則，如有變更者，我們將一併修改本「隱私權聲明」及其生效日期，以確保您知道我們收集哪些資訊、我們可能使用資訊的方式，以及我們可能向誰公開資訊。我們也會在本「隱私權聲明」有任何重大變更時，在我們網站上放置醒目的公告來通知您。請務必定期查看本聲明以瞭解我們如何保護您的資訊。如您不同意變更者，請立即停止使用本網站之服務，已申請會員帳號者並請立即刪除帳號，感謝您的配合。
          </TextStyle>
          <br />
          <br />
        </DivStyle>
      </RootStyle>
    </div>
  );
};

export default privacy;

const TittleStyle = styled.div`
  font-size: 32px;
  text-align: justify;
  color: #ffffff;
  @media (max-width: 768px) {
    margin: 0px 10px;
  }
  @media (max-width: 320px) {
    margin: 0px 10px;
  }
`;
const RootStyle = styled.div`
  max-width: 910px;
  margin: auto;
`;
const DivStyle = styled.div`
  background-color: #535664;
  display: flex;
  flex-direction: column;
  align-items: flex-start;
  width: 100%;
  margin: 0px 10px;
`;
const SubStyle = styled.div`
  font-size: 24px;
  text-align: justify;
  color: #d1ff5b;
  @media (max-width: 768px) {
    margin: 0px 10px;
  }
  @media (max-width: 320px) {
    margin: 0px 10px;
  }
`;
const TextStyle = styled.div`
  font-size: 16px;
  color: #b2b4bf;
  line-height: 1.5;
  text-align: justify;
  @media (max-width: 768px) {
    max-width: 720px;
    margin: 0px 10px;
  }
  @media (max-width: 320px) {
    max-width: 288px;
    margin: 0px 10px;
  }
`;

const P = styled.p`
  font-size: 16px;
  color: #ffffff;
  line-height: 1.5;
  text-align: justify;
  text-indent: 20px;
`;
